app/views/comments/destroy.js.erb

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 6]]
---
<% if @comment.destroyed? %>
   $('#comment-' +<%= @comment.id %>).hide();
     $('.js-comments-count').html("<%= pluralize(@comment.user.comments.count, 'comment') %>");