app/controllers/comments_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "posts".* FROM "posts" WHERE "posts"."topic_id" = ? AND "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["topic_id", 4], ["id", 10]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Super Cool!!!"], ["user_id", 1], ["post_id", 10], ["created_at", "2015-02-25 03:08:39.377748"], ["updated_at", "2015-02-25 03:08:39.377748"]]
---
  def create
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.find(params[:post_id)]
    @comments = @post.comments

    @comment = current_user.comments.build(params[:comment])
    @comment.post = @post

    authorize! :create, @comment, message: "You need to be signed in to do that."
      if @comment.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 12]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ?  ORDER BY updated_at DESC LIMIT 1  [["post_id", 12], ["id", 8]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 8]]
---
   def destroy
     @topic = Topic.find(params[:topic_id])
     @post = @topic.posts.find(params[:post_id])
     @comment = @post.comments.find(params[:id])

     authorize @comment
     if @comment.destroy