app/controllers/favorites_controller.rb

   def destroy
     @post = Post.find(params[:post_id])
     @topic = @post.topic
     #favorite = Favorite.find(params[:id])
     favorite = Favorite.where(post_id: params[:post_id], user_id: current_user.id).first
     authorize favorite
     # Get the post from the params
     # Find the current user's favorite with the ID in the params

     if favorite.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 10]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ?  ORDER BY "favorites"."id" ASC LIMIT 1  [["post_id", 10], ["user_id", 6]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 9]]

     def create
     @post = Post.find(params[:post_id])
     @topic = @post.topic
     favorite = current_user.favorites.build(post: @post)
     authorize favorite

     if favorite.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 8]]
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 8], ["user_id", 6], ["created_at", "2015-03-03 02:55:14.430907"], ["updated_at", "2015-03-03 02:55:14.430907"]]