app/controllers/topics_controller.rb

  def index
      #@topics = Topic.all
      #@topics = Topic.paginate(page: params[:page], per_page: 10)
      @topics = Topic.visible_to(current_user).paginate(page: params[:page], per_page: 10)
---
SELECT  "topics".* FROM "topics" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "topics"

  def show
      @topic = Topic.find(params[:id])
      #@posts = @topic.posts
      #@posts = @topic.posts.paginate(page: params[:page], per_page: 10)
      authorize @topic
        #@posts = @topic.posts.includes(:user).paginate(page: params[:page], per_page: 10)
        @posts = @topic.posts.includes(:user).includes(:comments).paginate(page: params[:page], per_page: 10)
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "posts".* FROM "posts" WHERE "posts"."topic_id" = ?  ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["topic_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (12, 9)  ORDER BY updated_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (6)
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 50]]

  def edit
      @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 8]]

  def create
    @topic = Topic.new(params.require(:topic).permit(:name, :description, :public))
      #raise #this will short circuit the method and can be used for debugging
      authorize @topic

    if @topic.save
---
INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Wow - Super Exciting Red Camaro"], ["description", "Incredible - see how fast it goes!"], ["created_at", "2015-02-24 20:53:31.256492"], ["updated_at", "2015-02-24 20:53:31.256492"]]

def update
    @topic = Topic.find(params[:id])
      authorize @topic

    if @topic.update_attributes(params.require(:topic).permit(:name, :description, :public))
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "topics" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?

def destroy
     @topic = Topic.find(params[:id])
     name = @topic.name

     authorize @topic
     if @topic.destroy
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 5]]