app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", ""], ["avatar", "yehsxt6neloikroh06oe.jpg"], ["updated_at", "2015-02-26 00:31:04.838671"], ["id", 1]]
---
   def update
     if current_user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
   def show
    @user = User.find(params[:id])